meeting/agenda/2023/06-06.org
:PROPERTIES:
:ID:       8D192696-D85C-461E-A29B-7DE8C83B78D4
:END:
#+title: QT4 CG Meeting 037 Agenda 2023-06-06
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/05-30.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
6 June,
the following meeting is scheduled for
13 June.

Any regrets for the following meeting?

** Review of open action items [2/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
  + This is related to PR #368: Issue 129 - Context item generalized to context value and
    subsequent discussion.
+ [ ] QT4CG-029-01: RD+DN to draft spec prose for the “divide and conquer” approach outlined in issue #399
+ [ ] QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
  See PR [[https://qt4cg.org/dashboard/#pr-449][#449]]
+ [ ] QT4CG-035-01: CG to make a few more (slightly more complex) ~map:keys~ examples.
+ [ ] QT4CG-035-02: CG to fix the type signature and examples in ~map:filter~.
+ [ ] QT4CG-035-03: NW to attempt to draft a PR that allows xs:string to be promoted to xs:anyURI
+ [ ] QT4CG-036-01: NW to draft a PR to resolve issue #414 along the lines MK proposed.
+ [ ] QT4CG-036-02: MK to revise function identity following the discussion in meeting 036.
+ [ ] QT4CG-036-03: MK to revise PR #521 following the discussion in meeting 036.

** Review of open pull requests
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-454][#491]]: Fix more examples in the FO 4.0 spec

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-521][#521]]: 518: Add transitive-closure() function
+ PR [[https://qt4cg.org/dashboard/#pr-512][#512]]: 256: Context for default function parameter expressions
+ PR [[https://qt4cg.org/dashboard/#pr-368][#368]]: 129: Context item generalized to context value
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528: revision of json(), and renaming to xdm-to-json()
+ PR [[https://qt4cg.org/dashboard/#pr-533][#533]]: Spec for CSV parsing with fn:parse-csv()

The following editorial or otherwise minor PRs were open when this
agenda was prepared. The chair proposes that these can be merged
without discussion. If you think discussion is necessary, please say
so.

+ PR [[https://qt4cg.org/dashboard/#pr-535][#535]]: Editorial: add an entry to the changes appendix
+ PR [[https://qt4cg.org/dashboard/#pr-534][#534]]: 530: escape solidus in JSON
+ PR [[https://qt4cg.org/dashboard/#pr-532][#532]]: fix error in LambdaParams rule

The following PRs appear to be candidates for a future XSLT-focussed
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-470][#470]]: 369 add fixed-prefixes attribute in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-412][#412]]: 409, QT4CG-027-01: xsl:next-match

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #521: 518: Add transitive-closure() function
:PROPERTIES:
:CUSTOM_ID: pr-521
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-521][#521]]

** PR #512: 256: Context for default function parameter expressions
:PROPERTIES:
:CUSTOM_ID: pr-512
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-512][#512]]

** PR #368: 129: Context item generalized to context value
:PROPERTIES:
:CUSTOM_ID: pr-368
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-368][#368]]

** PR #529: 528: revision of json(), and renaming to xdm-to-json()
:PROPERTIES:
:CUSTOM_ID: pr-529
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-529][#529]]

** PR #533 Spec for CSV parsing with fn:parse-csv()
:PROPERTIES:
:CUSTOM_ID: pr-533
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-533][#533]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
